train_SM/generate_data/original_snappy/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    up
    {
        type            empty;
    }
    down
    {
        type            empty;
    }
    geometry_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    geometry_inlet
    {
        type            zeroGradient;
    }
    geometry_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    geometry_obstacle
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
