train_SM/generate_data/original_snappy/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       latestTime;//If we restart simulation continues from the last time step

startTime       0;

stopAt          endTime;

endTime         1;//we stop after 5 s - adjustableRunTime!  # should be 12.5

deltaT          0.001;//initial time step size

writeControl    adjustableRunTime;//simulation can automatically adjust the time step according to the Courant number

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;//adjustableRunTime can modifiy the time step size

adjustTimeStep  yes;//adjustableRunTime can modifiy the time step size

//JN: Co = U*dt/dx
//U is defined by the flow
//dx is defined by the cell size i.e. the mesh
//Co should be below or equal to 1
//dt is the only value, which can guarantee this
//dt is changed in each time step

maxCo           1;//maximum value for Courant number

maxDeltaT       2e-3;//maximum time step

// ************************************************************************* //
